
## Plan Result (admin)

[CI link](https://github.com/hkak03key/terraform-useful-code/actions/runs/8371059090)


<pre><code>Plan: 14 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.terraform_backend_ci_tf_module.aws_dynamodb_table.default
  * module.terraform_backend_ci_tf_module.random_password.aws_s3_bucket_secure_suffix
  * module.terraform_backend_ci_tf_module.module.aws_iam_role_github_actions[&#34;default&#34;].aws_iam_role.default
  * module.terraform_backend_ci_tf_module.module.aws_iam_role_github_actions[&#34;default&#34;].aws_iam_role_policy_attachment.these[&#34;AdministratorAccess&#34;]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_iam_policy_attachment.aws_s3_bucket_core_read[0]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_iam_policy_attachment.aws_s3_bucket_core_readwrite[0]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_policy.default[0]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_public_access_block.default
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_server_side_encryption_configuration.default
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].aws_kms_alias.default
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].aws_kms_key.default
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_iam_policy.defaults[&#34;read&#34;]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_iam_policy.defaults[&#34;readwrite&#34;]
  * module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_s3_bucket.default


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.terraform_backend_ci_tf_module.aws_dynamodb_table.default will be created
  + resource "aws_dynamodb_table" "default" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "admin-terraform-backend-ci-tf-module"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # module.terraform_backend_ci_tf_module.random_password.aws_s3_bucket_secure_suffix will be created
  + resource "random_password" "aws_s3_bucket_secure_suffix" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = false
    }

  # module.terraform_backend_ci_tf_module.module.aws_iam_role_github_actions["default"].aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:hkak03key/terraform-useful-code:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::***:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "***-admin-terraform-backend-ci-tf-module-gh-act"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"   = "***-admin-terraform-backend-ci-tf-module-gh-act"
          + "module" = "../../shared_modules/aws_iam_role_github_actions"
        }
      + tags_all              = {
          + "Name"              = "***-admin-terraform-backend-ci-tf-module-gh-act"
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "module"            = "../../shared_modules/aws_iam_role_github_actions"
          + "terraform_root"    = "admin"
        }
      + unique_id             = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_iam_role_github_actions["default"].aws_iam_role_policy_attachment.these["AdministratorAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "these" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "***-admin-terraform-backend-ci-tf-module-gh-act"
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.data.aws_iam_policy_document.force_kms_encrypt_bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "force_kms_encrypt_bucket_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.data.aws_iam_policy_document.s3_deny_excluding_specified_iam_ids_bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_deny_excluding_specified_iam_ids_bucket_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_iam_policy_attachment.aws_s3_bucket_core_read[0] will be created
  + resource "aws_iam_policy_attachment" "aws_s3_bucket_core_read" {
      + id         = (known after apply)
      + name       = (known after apply)
      + policy_arn = (known after apply)
      + roles      = (known after apply)
      + users      = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_iam_policy_attachment.aws_s3_bucket_core_readwrite[0] will be created
  + resource "aws_iam_policy_attachment" "aws_s3_bucket_core_readwrite" {
      + id         = (known after apply)
      + name       = (known after apply)
      + policy_arn = (known after apply)
      + roles      = (known after apply)
      + users      = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_public_access_block.default will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].data.aws_iam_policy_document.allow_attachment_of_persistent_resources_kms_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_attachment_of_persistent_resources_kms_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].data.aws_iam_policy_document.allow_use_of_the_key_kms_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_use_of_the_key_kms_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].data.aws_iam_policy_document.kms_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kms_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "kms:*"
                          + Condition = {
                              + StringEquals = {
                                  + "aws:PrincipalType" = "Account"
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::***:root"
                            }
                          + Resource  = "*"
                          + Sid       = "Enable Root Access"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = [
                              + "kms:Describe*",
                              + "kms:Get*",
                              + "kms:List*",
                            ]
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::***:root"
                            }
                          + Resource  = "*"
                          + Sid       = "Enable IAM User Permissions for Read Accecss"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = [
                              + "kms:Create*",
                              + "kms:Describe*",
                              + "kms:Enable*",
                              + "kms:List*",
                              + "kms:Put*",
                              + "kms:Update*",
                              + "kms:Revoke*",
                              + "kms:Disable*",
                              + "kms:Get*",
                              + "kms:Delete*",
                              + "kms:TagResource",
                              + "kms:UntagResource",
                              + "kms:ScheduleKeyDeletion",
                              + "kms:CancelKeyDeletion",
                            ]
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = [
                                  + "arn:aws:iam::***:user/hkak03key@gmail.com",
                                  + "arn:aws:iam::***:role/***-admin-terraform-backend-admin-gh-act-deploy",
                                ]
                            }
                          + Resource  = "*"
                          + Sid       = "Allow access for Key Administrators"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].aws_kms_alias.default will be created
  + resource "aws_kms_alias" "default" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/admin-terraform-backend-ci-tf-module-s3"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_kms[0].aws_kms_key.default will be created
  + resource "aws_kms_key" "default" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_caller_identity.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "default" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_region.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "default" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_iam_policy.defaults["read"] will be created
  + resource "aws_iam_policy" "defaults" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3-read-***-admin-terraform-backend-ci-tf-module"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::***-admin-terraform-backend-ci-tf-module"
                    },
                  + {
                      + Action   = "s3:Get*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::***-admin-terraform-backend-ci-tf-module/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_iam_policy.defaults["readwrite"] will be created
  + resource "aws_iam_policy" "defaults" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3-readwrite-***-admin-terraform-backend-ci-tf-module"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::***-admin-terraform-backend-ci-tf-module"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::***-admin-terraform-backend-ci-tf-module/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "***-admin-terraform-backend-ci-tf-module"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"ci-terraform","PRNumber":95,"Program":"tfcmt","SHA1":"88c9f3e895539f54b383161efb1ac8d990a232bf","Target":"admin","Vars":{},"WorkflowName":"CI Terraform"} -->